app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"

  def new
    @micropost = Micropost.new

    # @HieuND: add list choice of user
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "aojjaf"], ["created_at", "2015-02-04 14:46:58.511166"], ["updated_at", "2015-02-04 14:46:58.511166"], ["user_id", 0]]

    def set_micropost
      @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts"  WHERE "microposts"."id" = ? LIMIT 1  [["id", 1]]