app/controllers/users_controller.rb

  def show
    @microposts = Micropost.where(user_id: params[:id]);
---
SELECT "microposts".* FROM "microposts"  WHERE "microposts"."user_id" = 2

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-04 14:42:12.584885"], ["email", "afoajf@ajofj"], ["name", "a"], ["updated_at", "2015-02-04 14:42:12.584885"]]